; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph2 - mode
	image0 - mode
	infrared3 - mode
	spectrograph5 - mode
	thermograph6 - mode
	thermograph1 - mode
	infrared4 - mode
	Star0 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star7 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	GroundStation11 - direction
	GroundStation12 - direction
	GroundStation4 - direction
	Star2 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph5)
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared4)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph5)
	(supports instrument1 thermograph6)
	(supports instrument1 image0)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
)
(:goal (and
	(have_image Phenomenon13 spectrograph2)
	(have_image Phenomenon13 thermograph6)
	(have_image Planet14 image0)
	(have_image Planet14 infrared4)
	(have_image Planet15 infrared3)
	(have_image Planet15 thermograph6)
	(have_image Phenomenon16 spectrograph5)
	(have_image Phenomenon16 thermograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
2. (turn_to satellite0 star2 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star2)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 phenomenon13 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 8
5. (take_image satellite0 phenomenon13 instrument0 spectrograph2)
   added: (have_image phenomenon13 spectrograph2)
   goals met: 1 of 8
6. (turn_to satellite0 phenomenon16 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon16)
   goals met: 1 of 8
7. (take_image satellite0 phenomenon16 instrument0 spectrograph5)
   added: (have_image phenomenon16 spectrograph5)
   goals met: 2 of 8
8. (take_image satellite0 phenomenon16 instrument0 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 3 of 8
9. (turn_to satellite0 phenomenon13 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 8
10. (turn_to satellite0 planet14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet14)
   goals met: 3 of 8
11. (take_image satellite0 planet14 instrument0 infrared4)
   added: (have_image planet14 infrared4)
   goals met: 4 of 8
12. (turn_to satellite0 planet15 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet15)
   goals met: 4 of 8
13. (take_image satellite0 planet15 instrument0 infrared3)
   added: (have_image planet15 infrared3)
   goals met: 5 of 8
14. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 5 of 8
15. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 5 of 8
16. (turn_to satellite0 star2 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star2)
   goals met: 5 of 8
17. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 5 of 8
18. (turn_to satellite0 phenomenon13 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon13)
   goals met: 5 of 8
19. (take_image satellite0 phenomenon13 instrument1 thermograph6)
   added: (have_image phenomenon13 thermograph6)
   goals met: 6 of 8
20. (turn_to satellite0 planet14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet14)
   goals met: 6 of 8
21. (take_image satellite0 planet14 instrument1 image0)
   added: (have_image planet14 image0)
   goals met: 7 of 8
22. (turn_to satellite0 planet15 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet15)
   goals met: 7 of 8
23. (take_image satellite0 planet15 instrument1 thermograph6)
   added: (have_image planet15 thermograph6)
   goals met: 8 of 8
